In [3]:
import pandas as pd

## Задание 1

Для датафрейма log из материалов занятия создайте столбец source_type по следующим правилам:

- если источник traffic_source равен yandex или google, то в source_type ставится organic
- для источников paid и email из России - ставим ad
- для источников paid и email не из России - ставим other
- все остальные варианты берем из traffic_source без изменений

In [5]:
log_data = pd.read_csv('visit_log.csv', sep = ';')

In [6]:
log_data.head()

,timestamp,visit_id,url,region,user_id,traffic_source
0,1549980692,e3b0c44298,https://host.ru/3c19b4ef7371864fa3,Russia,b1613cc09f,yandex
1,1549980704,6e340b9cff,https://host.ru/c8d9213a31839f9a3a,Russia,4c3ec14bee,direct
2,1549980715,96a296d224,https://host.ru/b8b58337d272ee7b15,Russia,a8c40697fb,yandex
3,1549980725,709e80c884,https://host.ru/b8b58337d272ee7b15,Russia,521ac1d6a0,yandex
4,1549980736,df3f619804,https://host.ru/b8b58337d272ee7b15,Russia,d7323c571c,yandex

In [7]:
# если источник traffic_source равен yandex или google, то в source_type ставится organic
log_data.loc[log_data.traffic_source.isin(['yandex', 'google']), 'source_type'] = 'organic'

In [13]:
# для источников paid и email из России - ставим ad
log_data.loc[log_data.traffic_source.isin(['paid', 'email']) & (log_data.region == 'Russia'), 'source_type'] = 'ad'

In [16]:
# для источников paid и email не из России - ставим other
log_data.loc[log_data.traffic_source.isin(['paid', 'email']) & (log_data.region != 'Russia'), 'source_type'] = 'other'

In [20]:
# все остальные варианты берем из traffic_source без изменений
log_data.loc[:, 'source_type'].fillna(log_data.traffic_source, inplace = True)

In [22]:
log_data['source_type'].value_counts()

direct     7013
organic    5407
ad         3790
other      2728
Name: source_type, dtype: int64

## Задание 2

В файле URLs.txt содержатся url страниц новостного сайта. Вам необходимо отфильтровать его по адресам страниц с текстами новостей. Известно, что шаблон страницы новостей имеет внутри url следующую конструкцию: /, затем 8 цифр, затем дефис. Выполните следующие действия:

1. Прочитайте содержимое файла с датафрейм
2. Отфильтруйте страницы с текстом новостей, используя метод str.contains и регулярное выражение в соответствии с заданным шаблоном

In [23]:
url_data = pd.read_csv('URLs.txt')

In [24]:
url_data.head()

                                                 url
0                                            /world/
1                                           /latest/
2                                      /?updated=top
3  /politics/36188461-s-marta-zhizn-rossiyan-susc...
4  /world/36007585-tramp-pridumal-kak-reshit-ukra...

In [35]:
url_data.loc[url_data.url.str.contains(r'/\d{8}-')]

                                                  url
3   /politics/36188461-s-marta-zhizn-rossiyan-susc...
4   /world/36007585-tramp-pridumal-kak-reshit-ukra...
5   /science/36157853-nasa-sobiraet-ekstrennuyu-pr...
6   /video/36001498-poyavilis-pervye-podrobnosti-g...
7   /world/36007585-tramp-pridumal-kak-reshit-ukra...
..                                                ...
88  /cis/35984145-kreml-prokommentiroval-soobschen...
89  /video/36071019-olimpiyskie-obekty-rio-prevrat...
90  /science/36151301-nazvano-posledstvie-zloupotr...
91  /incidents/36027330-vospitatelnitsu-zatravili-...
92  /world/36103095-dominikanskih-zhurnalistov-ubi...

[84 rows x 1 columns]

## Задание 3

Используйте файл с оценками фильмов ml-latest-small/ratings.csv. Посчитайте среднее время жизни пользователей, которые выставили более 100 оценок. Под временем жизни понимается разница между максимальным и минимальным значением столбца timestamp для данного значения userId.

In [32]:
ratings_data = pd.read_csv('ml-latest-small/ratings.csv')
ratings_data['timestamp'] = pd.to_datetime(ratings_data['timestamp'], unit='s')

In [33]:
ratings_data.head()

   userId  movieId  rating           timestamp
0       1       31     2.5 2009-12-14 02:52:24
1       1     1029     3.0 2009-12-14 02:52:59
2       1     1061     3.0 2009-12-14 02:53:02
3       1     1129     2.0 2009-12-14 02:53:05
4       1     1172     4.0 2009-12-14 02:53:25

Поиск пользователей, которые выставили более 100 оценок

In [34]:
active_users = ratings_data.groupby('userId')['timestamp'].count().reset_index()

In [35]:
active_users.columns = ['userId', 'score_count']

In [36]:
active_users = active_users.loc[active_users['score_count'] > 100]

In [37]:
active_users.head()

    userId  score_count
3        4          204
7        8          116
14      15         1700
16      17          363
18      19          423

Отбор пользователей, которые выставили больше 100 оценок

In [38]:
active_users_ratings = ratings_data.loc[ratings_data['userId'].isin(active_users['userId'])]

In [39]:
active_users_ratings.head()

     userId  movieId  rating           timestamp
147       4       10     4.0 2000-02-06 04:17:25
148       4       34     5.0 2000-02-07 10:32:36
149       4      112     5.0 2000-02-06 04:16:22
150       4      141     5.0 2000-02-07 10:34:41
151       4      153     4.0 2000-02-06 04:29:06

Расчет среднего времени жизни пользователя

In [74]:
mean_livetime = active_users_ratings.pivot_table(index = 'userId', values = 'timestamp', aggfunc = lambda t: t.max() - t.min()).mean()

In [76]:
print('Среднее время жизни активного пользователя =', mean_livetime[0])

Среднее время жизни активного пользователя = 463 days 21:28:27.449612408

## Задание 4

Дана статистика услуг перевозок клиентов компании по типам (см. файл с кодом занятия).

- rzd - железнодорожные перевозки
- auto - автомобильные перевозки
- air - воздушные перевозки
- client_base - адреса клиентов

Необходимо сформировать две таблицы:

- таблицу с тремя типами выручки для каждого client_id без указания адреса клиента
- аналогичную таблицу по типам выручки с указанием адреса клиента

In [63]:
rzd = pd.DataFrame(
    {
        'client_id': [111, 112, 113, 114, 115],
        'rzd_revenue': [1093, 2810, 10283, 5774, 981]
    }
)
auto = pd.DataFrame(
    {
        'client_id': [113, 114, 115, 116, 117],
        'auto_revenue': [57483, 83, 912, 4834, 98]
    }
)
air = pd.DataFrame(
    {
        'client_id': [115, 116, 117, 118],
        'air_revenue': [81, 4, 13, 173]
    }
)
client_base = pd.DataFrame(
    {
        'client_id': [111, 112, 113, 114, 115, 116, 117, 118],
        'address': ['Комсомольская 4', 'Энтузиастов 8а', 'Левобережная 1а', 'Мира 14', 'ЗЖБИиДК 1', 
                    'Строителей 18', 'Панфиловская 33', 'Мастеркова 4']
    }
)

Соединение с железнодорожными перевозками. Адреса из таблицы клиентов не учитываются.

In [78]:
client_base_revenue = client_base.loc[:, ['client_id']].merge(rzd, how = 'left', on = 'client_id', suffixes = ('','rzd_'))

In [79]:
client_base_revenue

   client_id  rzd_revenue
0        111       1093.0
1        112       2810.0
2        113      10283.0
3        114       5774.0
4        115        981.0
5        116          NaN
6        117          NaN
7        118          NaN

Соединение с автоперевозками

In [69]:
client_base_revenue = client_base_revenue.merge(auto, how = 'left', on = 'client_id', suffixes = ('','auto_'))

Соединение с авиаперевозками

In [70]:
client_base_revenue = client_base_revenue.merge(air, how = 'left', on = 'client_id', suffixes = ('','air_'))

Результат

In [71]:
client_base_revenue

   client_id  rzd_revenue  auto_revenue  air_revenue
0        111       1093.0           NaN          NaN
1        112       2810.0           NaN          NaN
2        113      10283.0       57483.0          NaN
3        114       5774.0          83.0          NaN
4        115        981.0         912.0         81.0
5        116          NaN        4834.0          4.0
6        117          NaN          98.0         13.0
7        118          NaN           NaN        173.0

Добавление адреса в таблицу

In [72]:
client_base_revenue = client_base_revenue.merge(client_base, how = 'inner', on = 'client_id')

In [73]:
client_base_revenue

   client_id  rzd_revenue  auto_revenue  air_revenue          address
0        111       1093.0           NaN          NaN  Комсомольская 4
1        112       2810.0           NaN          NaN   Энтузиастов 8а
2        113      10283.0       57483.0          NaN  Левобережная 1а
3        114       5774.0          83.0          NaN          Мира 14
4        115        981.0         912.0         81.0        ЗЖБИиДК 1
5        116          NaN        4834.0          4.0    Строителей 18
6        117          NaN          98.0         13.0  Панфиловская 33
7        118          NaN           NaN        173.0     Мастеркова 4